Охотники_и_рыболовы/src/Reports/ПродажаПутевок/ПродажаПутевок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПродажаПутевок</name>
  <attributes>
    <name>СводныйОтчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяОрганизация</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ОтчетныеВидыДичи</types>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДичи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПоВидам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Охотники_и_рыболовы/src/Reports/ПродажаПутевок/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыписалиМы = Истина;
	ПолноправныйПользователь = ОхотаСерверПовтИсп.ПользовательИмеетПолныеПрава();
	
	Если НЕ ПолноправныйПользователь Тогда
		Отчет.ОсновнаяОрганизация = ОхотаСерверПовтИсп.ПолучитьНастройкуПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация"));
		Если Отчет.ОсновнаяОрганизация.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя не установлена основная организация");
			Отказ = Истина;
			Возврат;
		Иначе
			ОхотхозяйствоПользователя = Отчет.ОсновнаяОрганизация;
		КонецЕсли;
		Элементы.НашеОхотхозяйство.ТолькоПросмотр = Истина;
		Элементы.ОтчетПоВидам.Видимость = Ложь;
	Иначе
		Элементы.ВыписалиМы.Видимость = Ложь;
	КонецЕсли;
	
	НовыеПараметрыВыбора = ОхотаСерверПовтИсп.ПолучитьПараметрыВыбораПоСубъектуРФ();
	Элементы.НашеОхотхозяйство.ПараметрыВыбора = НовыеПараметрыВыбора;
	Элементы.МестаОхоты.ПараметрыВыбора = НовыеПараметрыВыбора;
	Отчет.ФорматДичи = Истина;
	Элементы.ВидДичи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ОтчетныеВидыДичи");
	Отчет.СводныйОтчет = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписалиМыПриИзменении(Элемент)
	Если НЕ ПолноправныйПользователь Тогда
		
		ПустоеОхотхозяйство =  ПредопределенноеЗначение("Справочник.Охотхозяйства.ПустаяСсылка");
		
		Отчет.ОсновнаяОрганизация = ?(ВыписалиМы,ОхотхозяйствоПользователя,ПустоеОхотхозяйство);
		Элементы.НашеОхотхозяйство.ТолькоПросмотр = ВыписалиМы;
		Отчет.МестоОхоты = ?(НЕ ВыписалиМы,ОхотхозяйствоПользователя,ПустоеОхотхозяйство);
		Элементы.МестаОхоты.ТолькоПросмотр = НЕ ВыписалиМы;
		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура СводныйОтчетПриИзменении(Элемент)
	
	Если Отчет.СводныйОтчет = Истина Тогда
		Элементы.ВидДичи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ОтчетныеВидыДичи");
	Иначе	
		Элементы.ВидДичи.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыДичи");	
	КонецЕсли;

КонецПроцедуры
